{"activitymonitord": "/usr/libexec/activitymonitord", "AirPort Disk Agent (AirPort Disk Agent.app)": "Provides access to USB disk, that is connected to an AirPort Extreme Base Station.", "diskarbitrationd": "diskarbitrationd listens for connections from clients, notifies clients of the appearance of disks and filesystems, and governs the mounting of filesystems and the claiming of disks amongst clients.", "sleep": "The sleep utility suspends execution for a minimum of seconds.  It is usually used to schedule the execution of other commands.", "snmpget": "SNMP (Simple Network Management Protocol) application that uses the SNMP GET request to query for information on a network entity.", "scp": "scp utility copies files between hosts on a network. It uses ssh for data transfer, and uses the same authentication and provides the same security as ssh.", "RemotePairTool": "/System/Library/CoreServices/RemotePairTool", "System Events (System Events.app)": "System Events is an agent (or faceless background application) that supplies the terminology for using a number of features in AppleScript scripts.", "SpeechRecognitionServer (SpeechRecognitionServer.app)": "Scriptable front end for Mac's built-in speech recognition functionality.", "applepushserviced": "Daemon for Apple Push Notification service. This is part of the ApplePushService framework which allows Mac applications present dynamic content delivered over the Internet to user/computer.", "xsand": "Xsan is Apple Inc.'s SAN or clustered file system for Mac OS X. xsand ir Xsan conrolling daemon.", "nmbd": "NetBIOS name server to provide NetBIOS over IP naming services to clients. Also participates in the browsing protocols which make up  the  Windows \"Network Neighborhood\" view.", "KeyboardViewer (KeyboardViewer.app)": "Keyboard Viewer allows to see and type characters used in alternate languages other than your chosen language.", "tail": "Standard Unix command for displaying the last part of a file.", "UserNotificationCenter (UserNotificationCenter.app)": "/System/Library/CoreServices/UserNotificationCenter.app/Contents/MacOS/UserNotificationCenter", "troff": "troff is processor of the GNU Unix groff text formatting system.", "serialnumberd": "Mac OS X Server daemon for the Serial Number Infrastructure.", "aosnotifyd": "Daemon providing syncing between Mac and MobileMe.", "checkvir": "Backdoor:OSX/Imuler.A malware. Contacts a remote server for instructions; it may then steal files or capture a screenshot of the infected computer system, which is then forwarded to the remote server", "fsmpm": "Xsan File System Port Mapper daemon - server daemon residing on each Xsan File System client and server.", "kcm": "kcm is a process based credential cache for Kerberos (computer network authentication protocol used in Mac OS X) tickets.", "Activity Monitor (Activity Monitor.app)": "Activity Monitor utility monitors the activity of your computer's processor and disk, its memory, and its network activity.", "Directory Utility (Directory Utility.app)": "Directory Utility determines which directory services a Mac OS X computer uses and how it connects to directory domains.", "natpmpd": "natpmpd is a daemon implementing NAT-PMP - protocol for handling port forwarding requests from clients behind a NAT (network address translation). It is normally invoked by InternetSharing.", "rpcsvchost": "rpcsvchost is a environment for hosting DCE/RPC services. It loads services from the list of plugins given as arguments and listens for protocol requests.", "qmasterqd": "Part of Compressor (utility from Final Cut Pro application).", "pbs": "pbs is a helper tool for the Cocoa frameworks.", "AppleMobileBackup (AppleMobileDeviceHelper.app)": "Backup utility for iPhone and iPod Touch.", "tclsh": "Tclsh  is a shell-like application that reads Tcl commands from its standard input or from a file and evaluates (executes) them.", "check_afp (check_afp.app)": "Keeps the local AFP client in sync with the AFP Server when another client updates items on that same server, refreshes the reconnect authentication credential on a periodic basis and handles displaying AFP server messages.", "WindowServer": "Window Server is a single point of contact for all applications. Manages application windows and launch new applications.", "synchronize-preferences": "After changes in Samba configuration launchd process starts /usr/libexec/samba/synchronize-preferences which reads XML Samba plist and output an abbreviated (but typical looking) smb.conf file.", "dnsextd": "BIND Extension Daemon, invoked at boot time, running alongside BIND 9, to implement two EDNS0 extensions to the standard DNS protocol.", "DictionaryPanel (Dictionary.app)": "DictionaryPanel is alternative display method (you can activate it in Dictionary preferences) for Dictionary.app.", "tee": "The tee utility copies standard input to standard output, making a copy in zero or more files.", "rpc.lockd": "NFS (Network File System) file locking daemon, provides monitored and unmonitored file and record locking services in an NFS environment.", "cron": "Daemon to execute scheduled commands. Looks through the crontab files and follows scheduled instructions.", "quicklookd": "Quick Look daemon is a faceless background application that acts as a host for the CFPlugIn-based generators providing quick look functionality in Finder.", "activitymonitord (Activity Monitor.app)": "/Applications/Utilities/Activity Monitor.app/Contents/MacOS/activitymonitord", "cookied": "cookied is per-user HTTP cookie storage daemon which manages the user's cookie storage.", "imagent (imagent.app)": "/System/Library/PrivateFrameworks/IMCore.framework/imagent.app/Contents/MacOS/imagent", "mdmclient": "Used internally for communication with Mobile Device Management (Profile Manager) server. Receives configuration profiles and commands from the server after a user binds to the server by installing a binding profile. Part of Managed Client (MCX).", "launchctl unload": "launchctl interfaces with launchd to load, unload daemons/agents and generally control launchd.", "PTPCamera (PTPCamera.app)": "Helper application to acquire images from PTP (Picture Transfer Protocol) devices.", "hidd": "Human Interface Device daemon.", "odproxyd": "The odproxyd job maintains incoming proxy connections to the local OpenDirectory daemon (opendirectoryd). It should not be run manually.", "caffeinate": "caffeniate prevents the system from sleeping on behalf of a utility.", "fontworker": "fontworker is a OS X system daemon that registers and validates font for the \r\nsystem.", "AirPort Utility (AirPort Utility.app)": "AirPort Utility is setup and management utility for the AirPort Express Base Station, the AirPort Extreme Base Station and Time Capsule.", "WebProcess (WebProcess.app)": "Part of Safari (WebKit based browser) for isolating seperate broswer processes (e.g. seperate tabs).", "Keychain Scripting (Keychain Scripting.app)": "Keychain Scripting is background application that acts as acts as scriptable front-end to the user's keychain where password are stored.", "dirhelper": "Command is a launch-on-demand helper for special directory creation.  It is launched in a privileged context via launchd in order to create special directories where the user would not otherwise have permission to do so.", "helpd": "/System/Library/PrivateFrameworks/HelpData.framework/Versions/A/Resources/helpd", "com.apple.legacymediabridge.movieimportserver": "com.apple.legacymediabridge.movieimportserver", "softwareupdate": "Software Update checks for new and updated versions of your software based on information about your computer and current software.", "BezelUIServer": "BezelUIServer responds to things like volume and screen brightness settings by creating the translucent popups and helps launching FrontRow.", "mu-conference": "mu-conference is the iChat Server multi-user conference module- multi-user conference plugin for jabberd2. mu-conference is used as part of Mac OS X Server's iChat Server.", "NetAuthSysAgent (NetAuthAgent.app)": "NetAuthSysAgent is variant of NetAuthAgent (manages the authentication process at a high level on behalf of various clients included with Mac OS X) for handling system-level operations that do not require user interface.", "QuickTimeStreamingServer": "QuickTimeStreamingServer is the Real Time Streaming Protocol (RTSP)/Realtime Transport Protocol(RTP) server.", "System (System Events.app)": "System Events is an agent (or faceless background application) that supplies the terminology for using a number of features in AppleScript scripts. Among these features is GUI scripting, which allows your scripts to perform some actions in applications that have no built-in scripting support.", "qmastercc": "qmastercc is a part of Apple Qmaster - graphical “client interface” for distributed rendering and processing jobs management included in Final Cut Compressor application.", "qmasterca": "qmasterca is a part of Apple Qmaster - graphical “client interface” for distributed rendering and processing jobs management included in Final Cut Compressor application.", "nmblookup": "This tool is part of the samba suite and is used to query NetBIOS names and map them to IP addresses in a network using NetBIOS over TCP/IP  queries.", "Kerberos (Kerberos.app)": "The  Kerberos  system  authenticates individual users in a network environment.", "quicklookd32 (quicklookd32.app)": "Quick Look daemon is a faceless background application that acts as a host for the CFPlugIn-based generators providing quick look functionality in Finder.", "slapd": "Slapd is the stand-alone LDAP daemon. It listens for LDAP connections on any number of ports (default 389), responding to the LDAP operations it receives over these  connections.", "TWAINBridge": "TWAIN defines a standard software protocol and application programming interface (API) for communication between software applications and image acquisition device.", "named": "Internet domain name server (DNS).", "Xcode (Xcode.app)": "Apple's development environment for Mac OS X.", "quicklookd (quicklookd.app)": "Quick Look daemon is a faceless background application that acts as a host for the CFPlugIn-based generators providing quick look functionality in Finder.", "App Store (App Store.app)": "The Mac App Store is a digital distribution platform for Mac OS X applications.", "automountd": "Daemon that responds to requests from autofs to mount and unmount network filesystems, and to supply the contents of directories, based on the contents of automounter maps.", "QTKitServer": "Provides compatibility between 32 bit and 64 bit QuickTime services.", "KoreanIM (KoreanIM.app)": "/System/Library/Input Methods/KoreanIM.app/Contents/MacOS/KoreanIM", "mdworker32 MDSImporterWorker": "mdworker32 is the 32 bit version metadata server worker process. mdworker is used by mds to scan and index files as a volume is mounted or a file changes. Used for running 32 bit Spotlight plugins.", "QuickTime Player 7 (QuickTime Player 7.app)": "Apple Media player bundled with Mac OS X.", "SystemUIServer (SystemUIServer.app)": "Displays items on the right-hand end of the menu bar; loads menu and dock extras as plug-ins (started by WindowServer). In  a  managed environment,  it\t controls what can be mounted.", "httpd": "httpd  is the Apache webserver (HyperText Transfer Protocol (HTTP) server program).", "Console (Console.app)": "Console displays system messages written in system logs.", "XProtectUpdater": "Apple’s built-in malware detection system. Scans files that are marked by browsers and other tools as having been downloaded from the internet.", "CCacheServer (CCacheServer.app)": "Agent that maintains the Kerberos credentials cache for a specific user.", "ColorSync Utility (ColorSync Utility.app)": "ColorSync translates an image’s data between the color spaces of your devices so each device reproduces the image as accurately as possible.", "ioupsd": "Monitors UPS's.  PowerManagement's configd plugin automatically launches ioupsd whenever a UPS is connected to the system.", "ODBC Administrator (ODBC Administrator.app)": "ODBC Administrator lets you connect databases with applications that conform to the Open Database Connectivity (ODBC) standard.", "Win32.Drugtob": "IRCBot.OR is a 51326 byte worm that exploits a PnP vulnerability to infiltrate its host. The worm is runtime protected by Yoda and packed by UPX. On Windows 2000 systems the worm replicates and installs a bot as a payload. On other 32-bit systems the malware does not replicate but the bot is fully functional.", "dynamic_pager": "The dynamic_pager daemon manages a pool of external swap files which the kernel uses to support demand paging.", "sort": "Standart unix utility that sorts lines of text files and erite sorted concatenation of all files to standard output.", "smb-sync-preferences": "Used by launchd only.  Synchronizes preferences when SMB server preferences are modified.", "EncoderServer (iDVD.app)": "DVD creation software application.", "iWeb (iWeb.app)": "Website editor, part of Apple iLife suite.", "xargs": "The xargs utility reads space, tab, newline and end-of-file delimited strings from the standard input and executes utility (first paremeter) with the strings as arguments.", "mount_hfs": "Mount an HFS/HFS+ file system. This command is normally executed by mount at boot time.", "pppd": "PPP  is  the  protocol used for establishing internet links over dial-up modems, DSL connections, and many other types of point-to-point links.  The pppd daemon works together with the kernel PPP driver to  establish and maintain a PPP link with another system (called the peer) and to negotiate Internet Protocol (IP) addresses for each end of the link.", "System Profiler (System Profiler.app)": "System Profiler provides information about your computer, such as the hardware and software installed, the serial number and operating system, how much memory is installed, and what peripheral devices are connected.", "MDCrashReportTool (AppleMobileDeviceHelper.app)": "Application that provides option for sending iPhone crash reports to Apple.", "Front (Front Row.app)": "Front Row is media center software for Apple's Macintosh computers and Apple TV for viewing and downloading video, photos, podcasts, and music from a computer, optical disk, networks using iTunes or iPhoto, and the Internet using an Apple Remote.", "cvmsComp_x86_64": "/System/Library/Frameworks/OpenGL.framework/Versions/A/Libraries/cvmsComp_x86_64 1", "Grapher (Grapher.app)": "Grapher graphs curves, surfaces, inequalities, differential equations, discrete series, and vector and scalar fields. You can also create movie files of your graphs.", "AppleFileServer": "Apple File Protocol server.", "APNBridge": "APNBridge is a jabberd component to allow devices to subcribe to notifications and receive them via the Apple Push Notification Service.", "apsd-ft (FaceTime.app)": "Push notification services for FaceTime for Mac.", "cat": "The cat utility reads files sequentially, writing them to the standard output.", "mount_nfs": "The mount_nfs command calls the mount system call to prepare and graft a remote NFS file system on to the file system tree at the point directory.", "Conflict Resolver (Conflict Resolver.app)": "Conflict Resolver is an application used by .Mac service. Conflict Resolver is executed in the event that the .Mac Sync Service cannot decide on which version of the data to use.", "mv": "Unix standard command mv rename or move files.", "kerberosautoconfig": "Paart of Kerberos -- Open Directory Single Sign On feature. The kerberosautoconfig command creates / updates & removes the edu.mit.Kerberos file and the Kerberos:<REALM_NAME> config record in dslocal db from information stored in the Open Directory config record.", "Quartz Composer (Quartz Composer.app)": "Quartz Composer is a real-time visual programming environment integrated into the core of Mac OS X and bringing wide array of features into a wide variety of programs—integrating animation, MIDI, RSS, Networking, Audio Input/Analysis and Computer Statistics into existing and upcoming applications.", "tar": "The GNU version of the tar archiving utility, an archiving program designed to store and extract files from an archive file known as a tarfile.", "Jar Launcher (Jar Launcher.app)": "Jar Launcher is the program in Mac OS X that launches Java JAR files into the Aqua/Java runtime environment.", "appleprofilepolicyd": "appleprofilepolicyd is a system daemon that implements a access control policy for the services provided by AppleProfileFamily.", "kpasswdd": "kpasswdd serves request for password changes. It listens on UDP port 464 (service kpasswd) and processes requests when they arrive. It changes the database directly and should thus only run on the master KDC.", "sample": "sample is a command-line tool for gathering data about the running behavior of a process.", "Audio MIDI Setup (Audio MIDI Setup.app)": "Audio MIDI Setup configures the audio input and output devices connected to your computer.", "Interface (Interface Builder.app)": "Interface Builder is part of Xcode- Apple development tool. Interface Builder is used to create the user interfaces for iPhone OS and Mac OS X applications.", "TISwitcher (TISwitcher.app)": "/System/Library/CoreServices/Menu...", "filecoordinationd": "filecoordinationd provides system-wide file access coordination.", "ABAssistantService (ABAssistantService.app)": "/System/Library/Frameworks/AddressBook.framework/Versions/A/Resources/ABAssistantService.app/Conten...", "csh": "Berkeley UNIX C shell- command language interpreter usable both as an interactive login shell and  a  shell  script  command processor.", "FindSystemFiles": "/System/Library/PrivateFrameworks/SystemMigration.framework/Resources/FindSystemFiles -Z", "ping": "Standard unic command. Send ICMP ECHO_REQUEST packets to network hosts.", "UnmountAssistantAgent (UnmountAssistantAgent.app)": "/System/Library/CoreServices/UnmountAssistantAgent.app/Contents/MacOS/UnmountAssistantAgent", "iTunesHelper.app (iTunes.app)": "Tunes Helper runs in the background and monitors for the connection of any iPod or iPhone to the computer, if an iPod or iPhone is detected it will automatically launch the iTunes application.", "Spotlight (Spotlight.app)": "Spotlight is a system-wide desktop search feature of Apple's Mac OS X operating system.", "DiskManagementTool": "Component of Disk Utility that actually performs the task of repairing permissions.", "spindump_symbolicator": "Helper process for spindump - tool used by various system components to create reports when an unresponsive application is force quit.", "fs": "Defines format of file system volume.", "tcsh": "tcsh  is an enhanced but completely compatible version of the Berkeley UNIX C shell, csh(1).  It is a command language interpreter usable both as an interactive login shell and  a  shell  script  command processor.", "Chess (Chess.app)": "Chess game for Mac OS X.", "TCIM (TCIM.app)": "/System/Library/Input Methods/TCIM.app/Contents/MacOS/TCIM", "arch": "arch utility will print architecture type of your operating system or run selected architecture of a universal binary.", "man": "Standard Unix utility man format and display the on-line manual pages.", "lipo": "The lipo command creates or operates on ``universal'' (multi-architecture) files.", "rpc.rquotad": "Remote quota server which returns quotas for a user of a local filesystem which is NFS-mounted onto a remote machine.", "com.apple.dock.extra": "com.apple.dock.extra", "su": "Substitute user identity. It requests the password for login and switches to that user and group ID after obtaining proper authentication.", "sh": "Sh-compatible command language interpreter that executes commands read from the standard input or from a file.", "sftp-server": "sftp-server is a program that speaks the server side of SFTP protocol to stdout and expects client requests from stdin.", "dspluginhelperd": "Support daemon for legacy DirectoryService plugins. DirectoryService has been replaced by opendirectoryd. dspluginhelperd provides support for 3rd party DirectoryService plugins. More information can be accessed from the Darwin Open Directory Page", "tbl": "tbl is part of the GNU Unix groff document formatting system.", "newsyslog": "newsyslog is a highly configurable program for managing and archiving log files.", "launchproxy": "launchproxy handles the inetd emulation for launchd (system process manager).", "System Preferences (System Preferences.app)": "Application used by Mac OS X to modify user preferences.", "logKextDaemon": "Freeware (http://code.google.com/p/logkext/) keylogger for OS X. If it's not installed by yourself it can be used to sneak passwords and other private information.", "SystemStarter": "Start, stop, and restart system services and startup items.", "uname": "The uname utility prints operating system details.", "RFBRegisterMDNS": "/System/Library/CoreServices/RemoteManagement/AppleVNCServer.bundle/Contents/Support/RFBRegisterMDNS", "quartz-wm": "Aqua Window Manager for the X Window System on OS X.", "ARDAgent": "ARDAgent is the application that responds to Apple Remote Desktop remote administration requests, screen sharing and the like.", "diskimages-helper": "Mounts compressed disk images.", "emond": "Event Monitor Daemon, accepts events from various services, runs them through a simple rules engine, and takes action. The actions can run commands; send email, SMS, or jabber messages; or update an RSS feed.", "ptmd": "ptmd is a platform thermal monitor daemon.", "s2s": "Server-to-server connector, manages connections between local components and other Jabber servers.", "com.apple.appkit.xpc.sandboxedServiceRunner": "com.apple.appkit.xpc.sandboxedServiceRunner", "Folder (Folder Actions Dispatcher.app)": "Server for managing folder actions. Each folder action now runs its own copy of the new Folder Actions Dispatcher application.", "Finder (Finder.app)": "Finder allows access to applications, hard disks, files, folders, and CDs.", "dotmacsyncclient": "MobileMe Sync Client command-line client.", "Installer (Installer.app)": "Installer is an application included in Mac OS X which extracts and installs files out of .pkg packages.", "autofsd": "Monitors network filesystem requests or configuration changes, and when such an event occurs, launches automount to update the mount points.", "bnepd": "The Bluetooth network daemon that handles all BNEP connections on the system.", "ls": "Unix command  that lists directory contents", "CharacterPalette (CharacterPalette.app)": "Character Palette is used to insert special characters, such as mathematical symbols, letters with accent marks, or arrows and other \"dingbats\" as well as to enter Japanese, Chinese, Korean characters and characters from other languages.", "rcd (rcd.app)": "Remote Control Daemon. Process signals from Apple Remote and pass input to appropriate applications (FrontRow, ITunes, iPhoto, etc.).", "rpc.statd": "Host status monitoring daemon, cooperates with rpc.statd daemons on other hosts to provide a status monitoring service.  The daemon accepts requests from programs running on the local host (typically, rpc.lockd, the NFS file locking daemon) to monitor the status of specified hosts.", "SyncServer (SyncServer.app)": "SyncServer handles synchronization jobs on Mac OS X that use the built-in sync engine.", "Safari Webpage Preview Fetcher": "Standalone utility that is called from Safari whenever users enter the Top Pages browser.", "python": "An interpreted, interactive, object-oriented programming language bundled with Mac OS X.", "stroke (Network Utility.app)": "Port scan component for Network Utility.", "syspolicyd": "syspolicyd embodies the system policy controlling what may be installed, loaded, executed, or otherwise used on the system. It manages the policy database file, and serves as a general oracle that other sys- tem components may use to determine the system policy's verdict on a proposed operation.", "fsck_msdos": "The fsck_msdos utility verifies and repairs FAT file systems (more commonly known as DOS file systems).", "iChat (iChat.app)": "iChat is an AOL Instant Messenger (AIM), MobileMe, ICQ and XMPP client.", "storeagent": "/System/Library/PrivateFrameworks/CommerceKit.framework/Versions/A/Resources/storeagent", "momc": "Model compiler, part of XCode developer tools, used to compile data model resources.", "slurpd": "Standalone LDAP Update Replication Daemon, used to propagate changes from one slapd database to another.  If slapd  is  configured  to produce a replication log, slurpd reads that replication log and sends the changes to the slave slapd instances via the LDAP  protocol.", "mdworker MDSSyncScanWorker": "mdworker is the metadata server worker process.  It is used by mds to scan and index files as a volume is mounted or a file changes.", "com.apple.legacymediabridge.videodecompression": "com.apple.legacymediabridge.videodecompression", "Font Book (Font Book.app)": "Default font manager for Mac OS X.", "vpnd": "Mac OS X VPN service daemon, listens for incoming connections, pairs each one with an available internal IP address and allows external hosts to tunnel via L2TP over IPSec or via PPTP from an insecure external network (such as the Internet) into a \"secure\" internal network, such as a corporate network.", "loginwindow (loginwindow.app)": "The loginwindow program controls several aspects of user sessions and coordinates the display of the login window and the authentication of users.", "FDERecoveryAgent": "FDERecoveryAgent sends encrypted CoreStorage key recovery information to Apple.  It is run only when \"Store the recovery key with Apple\" is selected, and even then only if the information could not be transmitted when that option was first selected.", "iCal": "Calendaring app bundled with Max OS X.", "tlsmgr": "tlsmgr  manages  the  Postfix  TLS  session caches.  It stores and retrieves cache entries on request by smtpd and smtp processes, and periodically removes entries that have expired.", "fontd": "fontd is a Mac OS X system font registration manager which makes fonts available to the system.", "launchd": "Systemwide and per-user daemon/agent manager.rn", "Podcast Capture (Podcast Capture.app)": "With Podcast Capture, you can record and distribute podcasts. To use Podcast Capture, you need access to a computer running Mac OS X Server 10.5 with Podcast Producer.", "iDVD (iDVD.app)": "Apple DVD creation software application, part of iLife suite.", "revisiond": "/System/Library/PrivateFrameworks/Ubiquity.framework/Versions/A/Support/revisiond", "blued": "Bluetooth daemon. Handles SDP transactions, link key management, and incoming connection acceptance.", "com.apple.hiservices-xpcservice": "com.apple.hiservices-xpcservice", "NotificationCenter (NotificationCenter.app)": "Notification app, introduced with Mac OS X version 10.8 (Mountain Lion).", "clamd": "Anti-virus daemon for Mac OS X Server, listens for incoming connections on Unix and/or TCP socket and scans files or directories on demand.", "watchdog": "Mac OS X Server service monitoring daemon used in previous versions for launching, monitoring, and relaunching critical services when they terminated. This capability has been superseded by launchd in latest OS X versions.", "qmastertaskd": "Provides automated work distribution and processing for high-volume projects created with certain digital visual effects software packages: Shake, Alias Maya, Final Cut Pro, Compressor, DVD Studio Pro and any UNIX command-line program.", "mds": "Metadata server.  It serves all clients of the metadata APIs, including Spotlight.", "Image Events (Image Events.app)": "Image Events is an AppleScript agent and supports the manipulation, from scripts, of images and image-related data through operations such as cropping, embedding, matching, padding, profiling, rotating, and scaling.", "Finder": "Finder allows access to applications, hard disks, files, folders, and CDs.", "Problem Reporter (Problem Reporter.app)": "/System/Library/CoreServices/Problem Reporter.app/Contents/MacOS/Problem Reporter -psn_0_14462410", "iPhone Simulator (iPhone Simulator.app)": "iPhone Simulator is an environment that allows to run iPhone applications on your Mac to perform initial testing. iPhone Simulator ir part of Xcode development tools.", "DashboardClient (Dock.app)": "Dashboard is a semi-transparent layer that floats above your desktop at the press of a key, and provides access to mini applications called widgets.", "auvaltool": "AudioUnit validation tool tests a specified AudioUnit for API and behavioural conformance.", "chflags": "Standard Unix ulitity to change file flags.", "mkfontscale": "Part of X11 environment. mkfontscale reads all of the scalable font files in the directory. For every  font  file  found, an X11 font name (XLFD) is generated, and is written together with the file name to a file fonts.scale in the directory.", "dpd": "Display Port daemon - listens for ACPI messages from SMC to change from internal mac mode to external display input mode upon display port hot-plug.", "DirectoryService": "DirectoryService gathers directory access information which includes permissions for directories and mounted disks and provides it to applications.", "rm": "The rm utility attempts to remove the non-directory type files specified on the command line.", "system_profiler": "system_profiler reports on the hardware and software configuration of the system.  It can generate plain text reports or XML reports which can be opened with SystemProfiler.app", "CSUserAgent": "/System/Library/CoreServices/CSUserAgent", "asr": "Apple Software Restore; copy disk images onto volumes, either directly or via a multicast network stream.", "Logic Pro (Logic Pro.app)": "Logic Pro is a digital audio workstation and MIDI sequencer software application for the Mac OS X platform. Logic Pro is part of Apple's Logic Studio bundle of professional music applications.", "sendmail": "Sendmail command implements the Postfix (e-mail transfer agent) to Sendmail compatibility interface.", "netstat": "Netstat is Unix utility that symbolically displays the contents of various network-related data structures.", "ARDAgent (ARDAgent.app)": "ARDAgent is the application that responds to Apple Remote Desktop remote administration requests, screen sharing and the like.", "AVCAssistant": "/System/Library/PrivateFrameworks/CoreMediaIOServices.framework/Resources/AVC.plugin/Contents/Resou...", "mysqld": "MySQL Server, included with Mac OS X.", "bash": "Bash  is  an sh-compatible command language interpreter that executes commands from the standard input or file.", "Mail (Mail.app)": "Default  e-mail program included with Mac OS X.", "startx": "startx script is a unix front end to xinit that provides a somewhat nicer user interface for running a single session of the X Window System.", "netbiosd": "/usr/sbin/netbiosd", "VTDecoderXPCServ": "VTDecoderXPCService provides sandboxed video decoding process for QuickTime Player.", "coreservicesd": "Core Services daemon. Core Services is the Mac OS X system layer that lies above the core operating system and below the services, frameworks, and libraries used in application development.", "osacompile": "Compiles AppleScripts and other OSA language scripts.", "openssl": "The openssl program is a command line tool for using the various cryptography functions of OpenSSL's crypto library from the shell.", "ath": "/System/Library/PrivateFrameworks/AirTrafficHost.framework/ath --pipe 54 57 --target...", "ocspd": "Performs caching and network fetching of Certificate Revocation Lists (CRLs) and Online Certificate Status Protocol (OCSP) responses.", "SpeechService": "Provides text-to-speech service from the Services menu.", "SubmitDiagInfo": "SubmitDiagInfo is a system process which runs periodically if the user has opted-in for automatic reporting of diagnostic information. SubmitDiagInfo collects and sends to Apple any recent diag-nostic diagnostic and cleans up any diagnostic information which was created more than 14 days ago and is no longer needed.", "pop3d:": "POP3 server process.", "Automator (Automator.app)": "Automator implements point-and-click (or drag-and-drop) creation of workflows for automating repetitive tasks.", "ParentalControls (ParentalControls.app)": "Parental Controls provides logging on activities performed by appropriate account, controls usage time limits, blocks specific websites and applications from being used.", "iMovie HD (iMovie HD.app)": "Apple video editing software application, part of iLife suite.", "router": "router is the core component of the jabberd system. It passes XML packets between the components, and manages the entry and exit of components onto the network.", "installd": "/System/Library/PrivateFrameworks/PackageKit.framework/Resources/installd", "watchdogtimerd": "Mac OS X Server automatic reboot daemon, indirectly responsible for rebooting the server hardware if the machine hangs or panics. When watchdogtimerd runs on supported hardware, it periodically resets the hardware watchdog timer. If the timer ever expires, the power management unit forces a hard reboot.", "ioreg": "Displays the I/O Kit registry.  It shows the heirarchical registry structure as an inverted tree.", "rpcbind": "Rpcbind is a server that converts RPC program numbers into DARPA protocol port numbers.  It is a replacement for the older portmap program.", "timezoned (timezoned.app)": "/System/Library/PreferencePanes/DateAndTime.prefPane/Contents/Resources/TimeZone.prefPane/Contents/...", "proxymap": "The  proxymap server  provides read-only or read-write table lookup service to Postfix (free and open-source mail transfer agent that routes and delivers electronic mail) processes.", "open": "The open command opens a file (or a directory or URL), just as if you had double-clicked the file's icon. If no application name is specified, the default application as determined via LaunchServices is used to open the specified files.", "kextcache": "The kextcache program creates kext caches, which speed up kext loading operations.  It is invoked auto-matically automatically as needed to rebuild system caches.", "cups-deviced": "CUPS (common unix printing system) device daemon, polls the backends for a list of available devices.", "Java Preferences (Java Preferences.app)": "/Applications/Utilities/Java Preferences.app/Contents/MacOS/Java Preferences -psn_0_721072", "iTunesHelper (iTunes.app)": "Listens for commands to help iTunes communicate with devices (such as iPod).", "top": "Standard UNIX program that periodically displays a sorted list of system processes.", "mkdir": "The mkdir utility creates the directories named as operands, in the order specified.", "Activity (Activity Monitor.app)": "Activity Monitor utility monitors the activity of your computer's processor and disk, its memory, and its network activity.", "master": "The  master daemon is the resident process that runs Postfix daemons on demand: daemons to send or receive messages via the network, daemons to deliver mail locally, etc.", "QuickTime Player (QuickTime Player.app)": "Multimedia framework for handling various formats of digital video, media clips, sound, text, animation, music, and interactive panoramic images.", "Automator Runner (Automator Runner.app)": "/System/Library/CoreServices/Automator Runner.app/Contents/MacOS/Automator Runner...", "mtmd": "Mobile Time Machine daemon stores actual copies of new and changed files into /.MobileBackups.", "Folder Actions Dispatcher (Folder Actions Dispatcher.app)": "Server for managing folder actions. Each folder action now runs its own copy of the new Folder Actions Dispatcher application.", "warmd_agent": "warmd_agent is only launched during Aqua logins. It retrieves the list of the 10 most recent applications launched by the user, as reported by LaunchServices, to speed up system by warming resources by warmd daemon.", "nfsd": "NFS (Network File System) server daemon, service NFS and MOUNT protocol requests from NFS client machines.", "slogin": "An alias of the ssh login command.", "Terminal (Terminal.app)": "Terminal emulator included in Apple's Mac OS X operating system.", "CharPaletteServer (CharPaletteServer.app)": "Character Palette is used to insert special characters, such as mathematical symbols, letters with accent marks, or arrows and other “dingbats,” into your documents.", "sjeng.ChessEngine (Chess.app)": "Sjeng chess engine for Apple Chess application.", "qmgr": "Postfix queue manager. It awaits  the  arrival of incoming mail and arranges for its delivery via Postfix delivery processes.", "Bluetooth File Exchange (Bluetooth File Exchange.app)": "Handles files exchanges between Bluetooth devices.", "grep": "Grep is standard UNIX command, it  searches  the named input files for lines containing a match to the given pattern.", "com.apple.lookupd": "/System/Library/PrivateFrameworks/Lookup.framework/Resources/com.apple.lookupd", "iCalExternalSync": "/System/Library/Frameworks/CalendarStore.framework/Resources/iCalExternalSync --oneshot --sync...", "distnoted": "Provides distributed notification services (CFNotificationCenter daemon process and related agent processes).", "coreaudiod": "Daemon used for Core Audio related purposes.", "mdworker32": "mdworker32 is the 32 bit version metadata server worker process. mdworker is used by mds to scan and index files as a volume is mounted or a file changes. Used for running 32 bit Spotlight plugins.", "kextd": "Responsible for loading and unloading kernel extensions (e.g. device drivers) as they are needed.", "iPhoto (iPhoto.app)": "iPhoto is photo organizing and editing application, part of iLife suite.", "zsh": "Zsh  is a UNIX command interpreter (shell) usable as an interactive login shell and as a shell script command processor.", "InkServer (InkServer.app)": "Ink (or Inkwell) provides handwriting recognition on Mac OS X if graphics tablet is connected to Mac.", "launchctl bootstrap": "launchctl interfaces with launchd to load, unload daemons/agents and generally control launchd.", "webdavfs_agent": "Agent providing set of extensions to the HTTP protocol which allows users to collaboratively edit and manage files on remote web servers.", "gssd": "gssd provides kernel access to the Generic Security Services API (GSS-API).", "runner": "/System/Library/PrivateFrameworks/Install.framework/Resources/runner", "eapolclient": "The eapolclient is used by Mac OS X to connect to 802.1x secured wireless networks.", "FindMyMacd": "/System/Library/PrivateFrameworks/FindMyMac.framework/Resources/FindMyMacd", "grotty": "grotty translates the output of GNU troff text formatting processor into a form suitable for typewriter-like devices.", "say": "Utility that uses the Speech Synthesis manager to convert input text to audible speech and either play it through the sound output device chosen in System Preferences or save it to an AIFF file.", "WebKitPluginAgent": "WebKitPluginAgent is sandboxed seperated process to run older browser plug-ins (e.g. Flash or 32bit plugins on 64 bit system).", "Automator Launcher (Automator Launcher.app)": "/System/Library/CoreServices/Automator Launcher.app/Contents/MacOS/Automator Launcher -psn_0_184365", "AppleSpell": "System-wide spell checking service.", "notifyd": "Server for the Mac OS X notification system.", "mcxalr": "Managed Client application launch restriction tool and agent - used internally to manage and implement application launch restrictions for Managed Clients (MCX). Also used by Workgroup Manager to sign applications as root to insure all permissions and modes are pre-served.", "Keychain (Keychain Access.app)": "Keychain is Apple Inc.'s password management system in Mac OS X and Mac OS 9.", "imap-login": "Part of Dovecot- open source IMAP and POP3 server for Linux/UNIX-like systems and included with Mac OS X Server.", "webfilterproxyd": "/System/Library/PrivateFrameworks/WebContentAnalysis.framework/Resources/webfilterproxyd", "MacSecurity": "Alternate name for Mac Defender malware - fake antivirus program. If downloaded and installed, shows fake virus infection alerts in an effort to convince users to enter credit card numbers to an insecure server.", "spindump_agent": "helper agent for spindump used by various system components to create reports when an unresponsive application is force quit.", "UserEventAgent": "Utility to manage user callbacks in response to events.", "securityd": "Security context daemon for Authorization and cryptographic operations, provides access to keychain items.", "Dashcode (Dashcode.app)": "Apple's development environment for creating dashboard widgets and Web applications.", "xpchelper": "XPC helper agent performs services on behalf of the XPC IPC facility (low-level library interface for interprocess communication).", "sm": "sm  provides instant messaging services to Jabber clients. It performs all the essential instant messaging services like rosters, presence tracking, message distribution and  subscriptions, plus more advanced features.", "sntp": "sntp command can be used as a SNTP client to query a NTP (Network Time Protocol) or SNTP (Simple Network Time Protocol) server and either display the time or set the local system's time (given suitable  privilege).", "com.apple.legacymediabridge.videodecompressionserver": "com.apple.legacymediabridge.videodecompressionserver", "dscl": "dscl is a general-purpose utility for operating on Directory Service directory nodes.  Its commands allow one to create, read, and manage Directory Service data.", "iCal Helper (iCal Helper.app)": "/System/Library/Frameworks/CalendarStore.framework/Versions/A/Resources/iCal...", "awk": "AWK is a programming language that is designed for processing text-based data, either in files or data streams. A version of the AWK language is a standard feature of nearly every modern Unix-like operating system, including OS X.", "Photo Booth (Photo Booth.app)": "Application for taking photos and video with an iSight camera or other webcams.", "SafariSyncClient (Safari.app)": "/Applications/Safari.app/Contents/SafariSyncClient.app/Contents/MacOS/SafariSyncClient...", "smbd": "Server to provide SMB/CIFS services to clients- filesharing and printing services  to  Windows  clients.", "gunzip": "gunzip expand files compressed with gzip- cross platform file compression utility.", "Instruments (Instruments.app)": "Instruments is an application for dynamically tracing and profiling Mac OS X code, part of Apple development tools.", "Abk (Abk.app)": "Mac keylogger with remote monitoring support. It supports stealth keystroke recording, screenshots capturing and sending the logs by email or FTP in a real time. If it's not installed by yourself it can be used to sneak passwords and other private information.", "bootpd": "NetBoot server implementing a DHCP/BOOTP server as defined in RFC951, RFC1542, RFC2131, and RFC2132, as well as a BOOTP/DHCP relay agent.", "Disk Utility (Disk Utility.app)": "Disk Utility lets you configure and manage disks and perform disk related tasks.", "writeconfig": "/System/Library/PrivateFrameworks/Admin.framework/Resources/writeconfig", "rotatelogs": "Rotatelogs is a simple program for use in conjunction with Apache's piped logfile feature to rotate Apache logs.", "MacDefender": "Mac Defender malware - fake antivirus program. If downloaded and installed, shows fake virus infection alerts in an effort to convince users to enter credit card numbers to an insecure server.", "AppleVNCServer": "Server for providing  access to your Mac remotely. Part of Apple Remote Desktop package.", "ManagedClient (ManagedClient.app)": "Managed Client for Mac OS X, or MCX, is a subset of Open Directory, the \r\nApple directory service.", "qmasterd": "Part of Compressor, utility from Final Cut Pro application.", "iTunes": "iTunes is digital media player used for playing and organizing digital music and video files. The program is also an interface to manage the contents on iPod and iPhone.", "sysctl": "Sysctl is an interface for examining and dynamically changing parameters in the Mac OS X (BSD based) operating system.  The sysctl utility retrieves kernel state and allows processes with appropriate privilege to set kernel state.", "BluetoothAudioAgent (BluetoothAudioAgent.app)": "/System/Library/CoreServices/BluetoothAudioAgent.app/Contents/MacOS/BluetoothAudioAgent", "Mingler (SyncServer.app)": "/System/Library/Frameworks/SyncServices.framework/Versions/Current/Resources/SyncServer.app/Content...", "find": "The find utility recursively descends the directory tree for each path listed, evaluating an expression in terms of each file in the tree.", "anvil": "The  Postfix (free and open-source mail transfer agent that routes and delivers electronic mail) anvil  server  maintains statistics about client connection counts or client request rates.", "webperfcache": "webperfcache is the Web Performance Cache daemon, which improves web server performance by caching static pages in memory.", "fc-cache": "fc-cache scans the font directories on the system and builds font information cache files for applications using fontconfig for their font handling.", "iMovie (iMovie.app)": "Apple video editing software application, part of iLife suite.", "SecurityAgent (SecurityAgent.app)": "Manages user interaction with securityd.", "local": "The  local  daemon  processes ensures local mail delivery.", "build_hd_index (ARDAgent.app)": "Collects data on remote computers about files/applications used and user activity.", "osascript": "Execute AppleScripts and other OSA language scripts.", "AppleIDAuthAgent": "/System/Library/CoreServices/AppleIDAuthAgent", "systemkeychain": "The systemkeychain can be used to create a system keychain, make it possible for a keychain to unlock another keychain, or test unlocking a keychain.", "update_dyld_shared_cache": "Ensures that dyld's shared cache is up-to-date. It is automatically run by launchd when dyld (dynamic link editor) notices the shared cache is out of date.", "spamd": "Daemonized version of spamassassin- intelligent email filter which uses a diverse range of tests to identify unsolicited bulk email, more commonly known as \"spam\".", "Software Update (Software Update.app)": "Software Update is a tool that installs the latest version of Apple software on computers running Mac OS X.", "hwmond": "Mac OS X Server Hardware monitoring daemon, runs in the background periodically collecting various information about the current state of the hardware.", "CVMCompiler": "Mac OS X Core Virtual Machine Compiler - daemon that performs generic slave tasks controlled by CVMServer.", "clang": "clang is a C, C++, and Objective-C compiler which encompasses preprocessing, parsing, optimization, code generation, assembly, and linking.", "imklaunchagent": "Launcher for Input Method Kit framework, supporting input methods for Chinese, Japanese, and other languages.", "ssh": "SSH client is a program for logging into a remote machine and for executing commands on a remote machine.", "mtmfs": "Mobile Time Machine file system daemon runs an NFS server on localhost which is then mounted at /Volumes/MobileBackups.", "Preview (Preview.app)": "Application for displaying and editing images and Portable Document Format (PDF) documents and open popular image files (including JPEG, TIFF, and PNG.", "setregion": "setregion is used by the DVD Player to set the disc region code for a DVD drive.", "sandbox-compilerd": "The Mac OS X sandbox profile compiler daemon, compiles sandbox profiles on behalf of the sandbox kernel extension.", "umount": "The umount is standard Unix command that remove a special device or the remote node (rhost:path) from the filesystem tree at the point node.", "awacsd": "Apple Wide Area Connectivity Service daemon - facilitate connections between devices using Back to My Mac.", "Firewall": "Firewall is included with Mac OS X 10.5 (Leopard) and allows to control connections on a per-application basis, rather than a per-port basis.", "CoreRAIDServer": "/System/Library/PrivateFrameworks/CoreRAID.framework/Resources/CoreRAIDServer", "kadmind": "KADM5 (Kerberos V5 KDC) administration server, accepts remote requests to administer the information in databases.", "ServerScanner": "/System/Library/CoreServices/ServerScanner", "whoami": "Display effective user id in Unix shell.", "powerd": "/System/Library/CoreServices/powerd.bundle/powerd", "cvmsComp_i386": "/System/Library/Frameworks/OpenGL.framework/Versions/A/Libraries/cvmsComp_i386 1", "iostat": "Iostat displays kernel I/O statistics on terminal, device and cpu operations.", "auditd": "The auditd daemon responds to requests from the audit utility and notifications from the kernel.  It manages the resulting audit log files and specified log file locations.", "quicklookd32": "Quick Look daemon is a faceless background application that acts as a host for the CFPlugIn-based generators providing quick look functionality in Finder.", "LaunchCFMApp": "Launch a preferred executable format application using the Code Fragment Manager (CFM). Typically, this is only run manually when a CFM application needs to be debugged in gdb.", "stackshot": "The stackshot daemon is used to capture stack traces for each thread on the system; this includes both user space and kernel stacks.", "sed": "The sed utility reads the specified files, or the standard input if no files are specified, modifying the input as specified by a list of commands.  The input is then written to the standard output.", "taskgated-helper": "Helper process for taskgated - system daemon that implements a access control policy for task_for_pid system service.", "PluginProcess (PluginProcess.app)": "/System/Library/PrivateFrameworks/WebKit2.framework/PluginProcess.app/Contents/MacOS/PluginProcess...", "c2s": "c2s  accepts  incoming  connections from clients, performs authentication and registration functions, and communicates with the session manager on their behalf.", "VDCAssistant": "Daemon responsible for iSight built-in camera.", "HelpViewer (HelpViewer.app)": "Help Viewer is a WebKit based HTML viewer for Mac OS X aimed at displaying help files and other documentation.", "pickup": "Postfix local mail pickup. It waits for hints that new mail has been dropped into the maildrop directory, and feeds it into the cleanup daemon.", "FileMerge (FileMerge.app)": "Utility graphically compares and merges two different versions of a file. A command line version is available through the Terminal application: opendiff. Part of Apple Development tools.", "mdwrite": "/System/Library/Frameworks/CoreServices.framework/Frameworks/Metadata.framework/Versions/A/Support/...", "launchctl": "launchctl interfaces with launchd to load, unload daemons/agents and generally control launchd.", "irb": "irb is the interactive Ruby language interpreter bundled with Mac OS X.", "Address Book (Address Book.app)": "Address Book application bundled with Mac OS X.", "smbclient": "Ftp-like client to access SMB/CIFS resources on servers.", "hdiejectd": "Helper for DiskImages framework. Undocumented, most probably responsible for ejecting/dismounting disk images.", "SafariDAVClient": "/System/Library/PrivateFrameworks/BookmarkDAV.framework/Helpers/SafariDAVClient", "trustevaluationagent": "trustevaluationagent", "X11.bin (X11.app)": "XQuartz (commonly referred to as X11.app) is Apple Inc.'s version of the X server, a component of the X Window System, for Mac OS X.", "ipconfig": "ipconfig is a utility that communicates with the IPConfiguration agent to retrieve and set IP configuration parameters.", "screen": "screen is a full-screen window manager with VT100/ANSI terminal emulation.", "PasswordService": "Mac OS X Server Password Server daemon, acts as the gatekeeper for user passwords and provides an authentication resource for all services running on the system.", "taskgated": "System daemon that implements a policy for the task_for_pid system service.  When the kernel is asked for the task port of a process, and preliminary access control checks pass, it invokes this daemon (via launchd) to make the decision.", "cut": "The cut utility cuts out selected portions of each line from each file and writes them to the standard output.", "python2.5": "python - an interpreted, interactive, object-oriented programming language budled with Mac OS X.", "logind": "/System/Library/CoreServices/logind", "Image Capture Extension (Image Capture Extension.app)": "Provides the connections between device modules and the application and providing a common interface between device modules and applications.", "Apple80211Agent (Apple80211Agent.app)": "/System/Library/CoreServices/Apple80211Agent.app/Contents/MacOS/Apple80211Agent -psn_0_602259", "rpc.yppasswdd": "YP update password file daemon, part of YP subsystem allowing network management of essential system files.", "SCHelper": "/System/Library/Frameworks/SystemConfiguration.framework/Resources/SCHelper", "login": "The login utility logs users (and pseudo-users) into the computer system.", "lsof": "lsof is Unix utility to list open files.", "UniversalAccess (UniversalAccess.app)": "Universal Access is a component of the Mac OS X operating system that provides computing abilities to the blind, deaf, and handicapped.", "ipfwloggerd": "Mac OS X firewall logging daemon on Mac OS X Tiger (10.4).", "xgridagentd": "Part of Xgrid Daemon. Xgrid is a distributed computing protocol that allows networked computers to contribute to a single task.", "chmod": "The chmod utility modifies the file mode bits of the listed files as specified by the mode operand. It may also be used to modify the Access Control Lists (ACLs) associated with the listed files.", "iCal (iCal.app)": "Calendaring application bundled with Mac OS X.", "idled": "Idled provides near real-time updates for IMAP IDLE, receives notifications of mailbox changes and signals the appropriate imapd to report the changes to the client.", "dovecot-auth": "Process handles all authentication for Dovecot- open source IMAP and POP3 server for Linux/UNIX-like systems and included with Mac OS X Server.", "cp": "Standard Unix command for copying files.", "MIDIServer": "The server process that loads, and manages all communication with MIDI drivers. Part of the CoreMIDI framework.", "ps": "Unix command, displays the currently-running processes.", "usbmuxd": "Performs USB multiplexing when synchronizing iTunes music libraries with USB music devices like iPods & iPhones.", "java": "Java runtime environment bundled with Mac OS X.", "pkgutil": "pkgutil reads and manipulates Mac OS X Installer flat packages, and provides access to the \"receipt\" database used by the Installer.", "freshclam": "Freshclam is a virus database update tool for ClamAV.", "vdecoder": "/System/Library/QuickTime/QuickTimeH264.component/Contents/Resources/vdecoder", "ThumbnailServer (iDVD.app)": "ThumbnailServer is part of iDVD application.", "AppleScript Runner (AppleScript Runner.app)": "AppleScript Runner is an implementation detail of features like Folder Actions and the Script Menu (they use AppleScript Runner to run scripts).", "xgridcontrollerd": "Part of Xgrid Daemon. Xgrid is a distributed computing protocol that allows networked computers to contribute to a single task.", "talagent": "talagent is a helper agent for the Transparent App Lifecycle feature (introduced in OS X 10.7 Lion).", "SoftwareUpdateCheck (Software Update.app)": "/System/Library/CoreServices/Software Update.app/Contents/Resources/SoftwareUpdateCheck...", "Help Viewer (Help Viewer.app)": "Help Viewer is a WebKit based HTML viewer for Mac OS X aimed at displaying help files and other documentation.", "Network Diagnostics (Network Diagnostics.app)": "Network Diagnostics is utility to diagnose problems related to Ethernet, AirPort, or internal or external modem connections.", "makewhatis": "The makewhatis utility collects the names and short descriptions from all the unformatted man pages in the directories and puts them into a file used by the whatis and apropos commands.", "Logic Express (Logic Express.app)": "Logic Express is a limited-functionality version of Apple Logic Pro, a MIDI sequencer and digital audio workstation software.", "chum": "Computer Hardware Understanding Development (CHUD) Tool helper daemon for provided authorized users access to privileged kernel interfaces.", "LKDCHelper": "LKDC is a Kerberos implementation that extends \"single sign-on\" capabilities into ad-hoc networks. The LKDC supports the AFP, CIFS, and VNC services included in Mac OS X and Mac OS X Server.", "iWorkServices": "Backdoor iWorkServ.A uses a file called iWorkServices and is part of the installer package included with  illegitimate copies of iWork 2009 distributed on file sharing sites.", "Property List Editor (Property List Editor.app)": "Property List Editor is part of Apple development suite Xcode.", "Screen Sharing (Screen Sharing.app)": "Screen sharing application. While your screen is shared, a user of another computer sees what’s on your screen and can open, move, and close files and windows, open applications, and even restart the computer.", "ruby": "Ruby is an interpreted scripting language for quick and easy object-oriented programming bundled with Mac OS X.", "lsboxd": "/usr/libexec/lsboxd", "FileSyncAgent (FileSyncAgent.app)": "/System/Library/CoreServices/FileSyncAgent.app/Contents/MacOS/FileSyncAgent -launchedByLaunchd", "QuickLookUIHelper (QuickLookUIHelper.app)": "/System/Library/Frameworks/Quartz.framework/Frameworks/QuickLookUI.framework/Resources/QuickLookUIH...", "mount": "The mount command prepare and graft a special device or the remote node on to the file system tree.", "IIDCAssistant": "/Library/Audio/Plug-Ins/HAL/iSightAudio.plugin/Contents/Resources/IIDCAssistant.bundle/Contents/Mac...", "sandboxd": "sandbox daemon, performs services on behalf of the Sandbox kernel extension- safety mechanism that restricts applications access to operating system resources.", "digest-service": "/System/Library/PrivateFrameworks/Heimdal.framework/Helpers/digest-service", "DVD Player (DVD Player.app)": "Default DVD player in Mac OS X.", "distccd": "distccd  is  the distributed C/C++ compiler server, part of Apple development toolset. It accepts and runs compilation jobs for network clients.", "suhelperd": "/System/Library/PrivateFrameworks/SoftwareUpdate.framework/Resources/suhelperd", "ScreenSaverEngine (ScreenSaverEngine.app)": "ScreenSaverEngine is the Cocoa application that displays screen saver modules at the appropriate times (after so many minutes, when the cursor is in a hot-corner, etc.). It is part of the ScreenSaver system.", "ReportCrash": "ReportCrash is the system process responsible for generating crash reports and notifying users when an application crashes.", "diskmanagementd": "diskmanagementd is the back-end daemon to the DiskManagement framework.", "vi": "vi is a family of screen-oriented text editors included with most Unix-based operational systems.", "repair_packages": "repair_packages is used by Disk Utility to verify or repair permissions on installed packages.", "Calculator (Calculator.app)": "Calculator is a basic calculator application bundled with Mac OS X.", "perl5.10.0": "Perl is a language optimized for scanning arbitrary text files, extracting information from those text files, and printing reports based on that information.", "locationd": "/usr/libexec/locationd", "svnserve": "Server for the 'svn' repository access method, allows access to Subversion repositories using the svn network protocol.", "Dictionary (Dictionary.app)": "Dictionary provides definitions and synonyms from the New Oxford American Dictionary, 2nd Edition and Oxford American Writers Thesaurus, 1st Edition.", "pictd": "Helper tool for the Cocoa frameworks.", "iTunes (iTunes.app)": "iTunes is digital media player used for playing and organizing digital music and video files. The program is also an interface to manage the contents on iPod and iPhone.", "TWAINBridge (TWAINBridge.app)": "Apple Image Capture uses a TWAIN software \"bridge\" TWAINBridge.app to access TWAIN Data Sources. This software allows all Image Capture clients to access TWAIN devices transparently as if they were being handled by Image Capture native scanner drivers.", "make": "Standard Unix utility used to determine automatically which pieces of a large program need to be recompiled, and issue the commands to recompile them.", "kcproxy": "/usr/libexec/kcproxy", "Download (Download Java Components.app)": "/System/Library/Java/Support/CoreDeploy.bundle/Contents/Download Java...", "Grab (Grab.app)": "Grab application takes a picture of all or part of your computer screen.", "backupd-helper": "Time Machine backup for Mac OS X Leopard.", "MacProtector": "Alternate name for Mac Defender malware - fake antivirus program. If downloaded and installed, shows fake virus infection alerts in an effort to convince users to enter credit card numbers to an insecure server.", "spindump": "spindump is a tool used by various system components to create hang reports and notify the user of application hangs.", "AirPort Base Station Agent (AirPort Base Station Agent.app)": "Monitors base stations on the network and provides software updates as well as access to hard drives attached to wireless router.rn", "Interface Builder (Interface Builder.app)": "Interface Builder is a visual design tool used to create the user interfaces of iPhone OS and Mac OS X applications, part of Xcode development tool.", "identd": "identd is a server which implements the TCP/IP proposed standard IDENT user  identification  protocol as specified in the RFC 1413 document.", "efax": "Send/receive faxes with Class 1, 2 or 2.0 fax modem.", "ssh-agent": "Authentication agent. Holds private keys used for public key authentication (RSA, DSA).", "AppleMobileDeviceHelper (AppleMobileDeviceHelper.app)": "Framework that powers iTune's-iPod and -iPhone data transfer.", "php": "PHP is a widely-used general-purpose scripting language that is especially suited for Web development and can be embedded into HTML", "ibtool": "ibtool  verifies,  updates,  and prints the contents of an Interface Builder document, generating its output in standard plist format.", "syslogd": "Apple System Log server- receives and processes log messages.rn", "Messages (Messages.app)": "Messages is an instant messaging software application that will replace iChat as the native Mac instant messaging client (OS X Mountain Lion) with support for iMessage, Apple's messaging service on iOS, as well as integration with FaceTime.", "iChatAgent (iChatAgent.app)": "Backround agent for iChat.", "getPPDVersion": "/usr/libexec/getPPDVersion /Library/Printers/PPDs/Contents/Resources/HP Officejet Pro 8500...", "xgridagenthelper": "Part of Xgrid Daemon. Xgrid is a distributed computing protocol that allows networked computers to contribute to a single task.", "gzip": "Unix file compression utility", "Migration Assistant (Migration Assistant.app)": "Migration Assistant is used to transfer important information, such as user accounts, applications, network and computer settings, and files, from one Mac computer to another via a FireWire cable or over a wired or wireless network.", "less": "Standard Unix utility less is a program similar to more, but which backward movement in the file as well as forward movement.", "pop3-login": "Part of Dovecot- open source IMAP and POP3 server for Linux/UNIX-like systems and included with Mac OS X Server.", "ksh": "KornShell, a standard/restricted command and programming language.", "fs_usage": "The fs_usage utility presents an ongoing display of system call usage information pertaining to filesystem activity.", "kill": "The kill utility sends a signal to or terminates processes.", "mysql": "MySQL command-line tool", "ServerPerfLog": "The Server Performance log daemon writes a variety of server performance information into the Apple System Log facility for use by Server.app and other programs that report on system performance.", "AppleScript Editor (AppleScript Editor.app)": "AppleScript Editor provides the ability to edit, compile, and execute scripts written in AppleScript.", "Java Web Start (Java Web Start.app)": "Java Web Start is included in the Java Runtime Environment (JRE) as part of Java SE 6.", "Python (Python.app)": "Python  is an interpreted, interactive, object-oriented programming language bundled with Mac OS X.", "cleanup": "The daemon processes inbound mail, inserts it into the incoming mail queue, and informs the queue manager of its arrival.", "logger": "Logger provides a shell command interface to the syslog system log module.", "natd": "Network Address Translation daemon.", "winbindd": "Name Service Switch daemon for resolving names from Windows NT servers. Part of Samba suite.", "DigitalColor Meter (DigitalColor Meter.app)": "DigitalColor Meter matchs the color on your screen against several industry standard spaces as well as see color value of any pixel on your display for copying into an HTML or graphics document.", "xterm": "The  xterm  program  is  a  terminal  emulator  for the X Window System.  It provides  terminals for  programs  that  cannot  use  the  window  system directly.", "RFBEventHelperd": "/System/Library/CoreServices/RFBEventHelper.bundle/Contents/MacOS/RFBEventHelperd", "Dock (Dock.app)": "Dock is the bar of icons that sits at the bottom or side of your screen and provides easy access to applications, displays which applications are currently running, holds windows in their minimized state and manages Dashboard widgets.", "resolver": "The resolver is a set of routines in the C library that provide access to the Internet Domain Name System (DNS).", "mdworker": "mdworker is the metadata server worker process.  It is used by mds to scan and index files as a volume is mounted or a file changes", "Network Utility (Network Utility.app)": "Network Utility combines several information and troubleshooting tools for networking.", "vim": "Vi IMproved, a programmers text editor, bundled with OS X.", "Safari Webpage Preview Fetcher (Safari.app)": "Standalone utility that is called from Safari (version 4) whenever users enter the Top Pages browser.", "socketfilterfw": "Mac OS X Leopard application firewall component restricting the ability of programs to \"bind\" a port so they can receive all traffic for that port.", "mdworker MDSImporterWorker": "Metadata server worker process.  It is used by mds to scan and index files as a volume is mounted or a file changes.rn", "ditto": "Unix utility to copy directory hierarchies, create and extract archives.", "pboard": "Pasteboard server.", "MobileSafari (MobileSafari.app)": "Mobile Safari app on iPhone Simulator - part of Apple's XCode developer tools.", "MassStorageCamera (MassStorageCamera.app)": "/System/Library/Image Capture/Devices/MassStorageCamera.app/Contents/MacOS/MassStorageCamera...", "com.apple.foundation.UserScriptService": "com.apple.foundation.UserScriptService", "launchdadd": "/usr/libexec/launchdadd", "krb5kdc": "Kerberos version 5 Authentication Service and Key Distribution Center.", "postmaster": "Part of Apple Remote Desktop application- desktop management solution.", "bounce": "The  bounce daemon maintains mail delivery status reports.", "kdc": "Key distribution center process of Kerberos security protocol.", "KernelEventAgent": "Disk & server events notifications. Notifies users about file and disk problems.", "aslmanager": "Apple System Log data store file manager. Manages files in the ASL data store written by the syslogd server.", "gdb-i386-apple-darwin": "The GNU Debugger for debugging programs written in C, C++, and Modula-2 par of Apple's Xcode developer tools.", "id": "The id utility returns user identity- displays the user and group names and numeric IDs.", "corestoraged": "corestoraged manages CoreStorage (logical filesystem abstraction layer) volumes.", "rsync": "rsync is a software application for Unix systems which synchronizes files and directories from one location to another using the rsync remote-update protocol.", "Preview": "Application for displaying and editing images and Portable Document Format (PDF) documents and open popular image files (including JPEG, TIFF, and PNG.", "lsregister": "lsregister search the paths for application bundles and add each found item to the Launch Services database.", "firmwaresyncd": "firmwaresyncd runs at boot time to synchronize the firmware file(s) from the root filesystem to the EFI System Partition (ESP). It does not run when the system is performing a Safe Boot.", "airportd": "airportd configures various wireless card parameters automatically. For example, automatically connects to a preferred wireless network after restart if the network is available.", "syncdefaultsd": "/System/Library/PrivateFrameworks/SyncedDefaults.framework/Support/syncdefaultsd", "scselect": "scselect provides access to the system configuration sets (locations) and allows the user to select or change the active \"location\".", "com.apple.security.pboxd": "Daemon process called Powerbox (pboxd) job is to present and control open/save dialog boxes on behalf of sandboxed applications.", "compressord": "Part of Final Cut Studio application, providing batch processes for encoding to a wide range of industry-standard formats.", "pmTool (Activity Monitor.app)": "Invoked by the Activity Monitor. Polls the system and collects detailed process information.", "Image Capture (Image Capture.app)": "Application program that enables users to upload pictures from digital cameras or scanners which are either connected directly to the computer or the network.", "kextload": "he kextload program is used to explicitly load kernel extensions (kexts).", "amavisd": "Amavisd is set up to act as a mini-SMTP server.", "quicklookconfig": "/System/Library/Frameworks/QuickLook.framework/Resources/quicklookconfig", "dovecotd": "Dovecot is an open source IMAP and POP3 server for Linux/UNIX-like systems and included with Mac OS X Server.", "update": "Responsible for keeping disks synchronized with the file system cache, to keep data loss to a minimum in case of a crash.", "racoon": "IKE (ISAKMP/Oakley) key management daemon. Speaks IKE protocol to establish security associations with other hosts.", "sshd": "OpenSSH daemon. Listens for connections from clients and provide secure encrypted communications between two untrusted hosts over an insecure network.", "AppleScript Utility (AppleScript Utility.app)": "AppleScript is an English-like language used to create script files that control the actions of the Mac and the applications that run on it.", "kcproxy (Keychain Access.app)": "KeyChain Access helper that manages trust settings changes for applications/certificates.", "srm": "srm securely removes files or directories by overwriting, renaming, and truncating it before unlinking.", "Locum": "/System/Library/PrivateFrameworks/DesktopServicesPriv.framework/Resources/Locum", "scutil": "Utility for managing Mac OS X system configuration parameters.", "smtpd": "Postfix SMTP server, accepts network connection requests and performs zero or more SMTP transactions per connection.", "authorizationhost (SecurityAgent.app)": "Provides authentication and authorization framework for applications.", "Kotoeri (Kotoeri.app)": "Kotoeri is a Japanese language input method which comes standard with Mac OS X, as well as earlier versions of the Mac OS.", "PubSubAgent (PubSubAgent.app)": "The PubSub agent syncs the RSS read/unread status of bookmarked RSS feeds between computers using Mac OS X 10.5 that are syncing bookmarks via MobileMe Sync.", "webfilterDNSd": "/System/Library/PrivateFrameworks/WebContentAnalysis.framework/Resources/webfilterDNSd", "uninstalld": "/System/Library/PrivateFrameworks/Uninstall.framework/Resources/uninstalld", "backupd": "Time Machine backup daemon.", "CVMServer": "Mac OS X Core Virtual Machine Server - system daemon that handles generic task execution in a slave process.", "IIDCVideoAssistant": "/System/Library/Frameworks/CoreMediaIO.framework/Resources/IIDC.plugin/Contents/Resources/IIDCVideo...", "snmpd": "snmpd is an SNMP (Simple Network Management Protocol) agent which awaits requests from SNMP management software, processes them, collects the requested information and/or  performs the requested operation(s) and returns the information to the sender.", "perl": "Practical Extraction and Report Language on UNIX based systems, optimized for scanning arbitrary text files, extracting information from those text files, and printing reports based on that information.", "librariand": "/usr/libexec/librariand", "mobilemesyncclient": "/System/Library/PrivateFrameworks/DotMacSyncManager.framework/Resources/mobilemesyncclient --sync...", "Boot Camp Assistant (Boot Camp Assistant.app)": "Part of Boot Camp - software included with OS X Lion so you can run compatible versions of Microsoft Windows on an Intel-based Mac.", "postdrop": "Postfix (e-mail transfer agent) mail posting utility.", "mDNSResponderHelper": "mDNSResponderHelper is an executable invoked by launchd to provide privilege separation to the mDNSResponder daemon.", "SpeechFeedbackWindow (SpeechFeedbackWindow.app)": "The speech feedback window appears when Speakable Items is on or an application uses Speech Recognition.", "emacs": "emacs is feature-rich text editor bundled with most Unix based systems.", "servermgrd": "Mac OS X Server administrative daemon, allows the Server Admin application to control the machine servermgrd is running on.", "groff": "groff is a front-end for the GNU Unix groff document formatting system.", "tcpdump": "Unix utility that dumps traffic on a network- prints out or saves a description of the contents of packets on a network interface that match the boolean expression.", "svn": "Subversion (version control system) command line client tool, bundled with Mac OS X.", "fsck_hfs": "The fsck_hfs utility verifies and repairs standard HFS and HFS+ file systems.", "traceroute": "traceroute prints the route packets take to designated network host.", "WebKitPluginHost (WebKitPluginHost.app)": "WebKitPluginHost is sandboxed individual process for running browser plugin.", "Stickies (Stickies.app)": "Notetaking application for putting Post-it note-like windows on the screen, with short reminders, notes and other clippings.", "updateSharingD": "/System/Library/Frameworks/JavaVM.framework/Versions/A/Resources/bin/updateSharingD", "getty": "Standard unix program running on a host computer that manages physical or virtual terminals (tty). When it detects a connection, it prompts for a username and runs the 'login' program to authenticate the user.", "Font (Font Book.app)": "Default font manager for Mac OS X.", "Safari (Safari.app)": "Apple's default web browser bundled with Mac OS X.", "sudo": "sudo allows a permitted user to execute a command as the superuser or another user.", "cups-polld": "cups-polld polls remote servers for a list of available printers and printer classes.", "FaceTime (FaceTime.app)": "FaceTime is a video calling software application and related protocol developed by Apple for Macs and supported mobile devices running the iOS.", "MigrateTool (Migration Assistant.app)": "/Applications/Utilities/Migration Assistant.app/Contents/Resources/MigrateTool", "Directory (Directory.app)": "The Directory application provides access to shared information about people, groups, locations, and resources within your organization.", "pcscd": "PC/SC Smartcard Daemon. It is a resource manager that coordinates communications with smart-card readers and smart cards and cryptographic tokens that  are connected to the system.", "SCIM (SCIM.app)": "Mac OS X input manager for Smart Common Input Method (SCIM).", "AddPrinter (AddPrinter.app)": "Utility for setting up new printing device in Mac OS X (Leopard).", "cupsd": "Common unix printing system daemon. It implements a printing system based upon the Internet Printing Protocol", "mDNSResponder": "mDNSResponder is a Bonjour system service that implements Multicast DNS Service Discovery for discovery of services on the local network, and Unicast DNS Service Discovery for discovery of services anywhere in the world.", "ypserv": "Ypserv is a part of the YP network information system, allowing network management of essential system files. This server provides information from YP maps to the YP clients on the network.", "PrintUITool": "/System/Library/PrivateFrameworks/PrintingPrivate.framework/Versions/A/PrintUITool", "IMServicePlugInAgent (IMServicePlugInAgent.app)": "/System/Library/Frameworks/IMServicePlugIn.framework/IMServicePlugInAgent.app/Contents/MacOS/IMServ...", "opendirectoryd": "opendirectoryd is replacement for DirectoryService in OS X Lion and Lion Server. See DirectoryService for more information on process.", "special_file_handler": "special_file_handler is the daemon that is called when data from a special file needs to be provided. These files are primarily used by Mobile Documents.", "curl": "curl  is  a  Standard Unix tool  to  transfer data from or to a server, using one of the supported protocols (HTTP, HTTPS, FTP, FTPS, SCP, SFTP, TFTP, DICT, TELNET, LDAP or FILE)", "fseventsd": "fseventsd reads file system changes events and writes the events to log files on disk.", "bzip2": "File compression utility.", "Folder Actions Setup (Folder Actions Setup.app)": "Utility that helps perform tasks related to Folder Actions, e.g - enable or disable Folder Actions, attach scripts to a folder etc.", "warmd": "Upon boot, the warmd launch daemon process warms system-wide resources once it deems that the boot is done. This primarily consists in pre-fetching the dyld shared caches.", "ODSAgent (ODSAgent.app)": "Privides DVD or CD Sharing.", "nc": "The nc (or netcat) utility is used for working with TCP or UDP network protocols.  It opens TCP connections, sends UDP packets, listens on arbitrary TCP and UDP ports, does port scanning, and deal with both IPv4 and IPv6.", "printtool": "/System/Library/Frameworks/ApplicationServices.framework/Frameworks/PrintCore.framework/Versions/A/...", "chgrp": "Standard Unix utility to change group of the Unix file.", "fgrep": "Variant  programs  for grep utility. Fgrep is the same as grep -F", "trivial-rewrite": "Postfix (free and open-source mail transfer agent that routes and delivers electronic mail) address rewriting and resolving daemon.", "ntpd": "The ntpd utility is an operating system daemon which sets and maintains the system time of day in synchronism with Internet standard time servers.", "SystemUIServer": "Displays items on the right-hand end of the menu bar; loads menu and dock extras as plug-ins (started by WindowServer).", "SpeechSynthesisServer (SpeechSynthesisServer.app)": "Framework that provides a standardized method for Macintosh applications to generate synthesized speech.", "whois": "The whois utility looks up records in the databases maintained by several Network Information Centers (NICs).", "TextEdit (TextEdit.app)": "TextEdit is simple yet highly versatile word processor bundled with Mac OS X.", "configd": "Maintains data reflecting the desired and current state of the system, provides notifications to  applications when this data changes, and hosts a number of configuration agents.", "AVRCPAgent (AVRCPAgent.app)": "/System/Library/CoreServices/AVRCPAgent.app/Contents/MacOS/AVRCPAgent -BTAutoLaunch -BTType L2CAP...", "ubd": "ubd is the ubiquity server process. It is primarily used for \"Mobile Documents\" (iCloud feature for syncing files).", "portmap": "Portmap is a server that converts RPC program numbers into DARPA protocol port numbers.  It must be running in order to make RPC calls.", "hdiutil": "hdiutil uses the DiskImages framework to manipulate disk images.  Common verbs include attach, detach, verify, create, convert, compact, and burn.", "docsetinstalld": "docsetinstalld is the daemon responsible for installing documentation sets for use by Apple's developer tools.", "locate.code": "Sorted list compressor used by locate (quick file finding utility) command.", "xinit": "X Window System initializer on Unix systems.", "InternetSharing": "InternetSharing is the back-end for the Internet Sharing feature.  It is responsible for configuring the network interfaces, the DHCP server, the network address translation daemon, and the Internet domain name server.", "NetAuthAgent (NetAuthAgent.app)": "NetAuthAgent initiates network logins for both SMB and AFP volumes. NetAuthAgent also launches an application called check_afp that is responsible for receiving messages from the server (among other things).", "Keychain Access (Keychain Access.app)": "Keychain is Apple Inc.'s password management system in Mac OS X and Mac OS 9.", "sftp": "sftp is an secure file transfer program, similar to ftp, which performs all operations over an encrypted ssh connection.", "iSync (iSync.app)": "iSync allows synchronizing Mac Address Book and iCal information with mobile handsets, Palm OS organizers and compatible smartphones.", "chown": "Unix utility that changes the user ID and/or the group ID of the specified files.", "kdcmond": "KDC monitoring daemon. It is an init-like process that launches, monitors, and relaunches the Kerberos KDC process, ensuring Open Directory Single Sign On.", "Safari (Safari 3.app)": "Mac OS X default web browser.", "service_helper": "The service_helper program assists in enabling and disabling various system services.", "hiutil": "hiutil is for creating and examining .helpindex files. These files were historically created by Help Indexer.app, which now calls this tool.", "ATSServer": "Apple Type Solution Server. Enables system-wide font management. Replaced with fontd daemon in Snow Leopard."}